app/controllers/cart_controller.rb

    def show
        #items = Cart.all;
        if Cart.exists?(:customer_id => params[:id])
            @cartvalue = Cart.where(customer_id: params[:id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id).to_a;
---
SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` IS NULL LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` IS NULL ORDER BY `carts`.`id` ASC LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 4

    def update
        if Cart.exists?(:customer_id => params[:id])
            @cartvalue = Cart.where(customer_id: params[:id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id])
            if pddetails.update_all(quantity: params[:quantity])
---
UPDATE `cart_items` SET `cart_items`.`quantity` = 10, `cart_items`.`updated_at` = '2020-10-26 16:54:13.202603' WHERE `cart_items`.`id` = 1

    def create
        if Cart.exists?(:customer_id => params[:customer_id])
            puts "exists";
            @cartvalue = Cart.where(customer_id: params[:customer_id]).first
            puts @cartvalue.id;
            params[:cart_id] = @cartvalue.id
            cartitem = CartItem.new(cartitem_params)

            if cartitem.save
                render json: {status: 'SUCCESS', message:'Added to cartitem', data:cartitem},status: :ok
            else
                render json: {status: 'ERROR', message:'Item not saved to cartitem', data:cartitem.errors},status: :unprocessable_entity
            end
        else
            @cart = Cart.new(cart_params);
            if @cart.save
                puts "cart added";
                params[:cart_id] = @cart.id
                cartitem = CartItem.new(cartitem_params)
                if cartitem.save
---
INSERT INTO `cart_items` (`cart_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES (2, 1, 1, '2020-10-30 06:54:04.338956', '2020-10-30 06:54:04.338956')
INSERT INTO `carts` (`customer_id`, `created_at`, `updated_at`) VALUES (1, '2020-10-30 07:01:01.386114', '2020-10-30 07:01:01.386114')
INSERT INTO `cart_items` (`cart_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES (5, 1, 1, '2020-10-30 07:01:01.541627', '2020-10-30 07:01:01.541627')

    def destroy
        if Cart.exists?(:customer_id => params[:id])
            @cartvalue = Cart.where(customer_id: params[:id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id])
            samplepd=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id]).to_a;
            if pddetails.delete_all
---
SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 2 AND `cart_items`.`item_id` = 1
DELETE FROM `cart_items` WHERE `cart_items`.`cart_id` = 4 AND `cart_items`.`item_id` = 1

    def deleteallItems
        if Cart.exists?(:customer_id => params[:id])
            @cartvalue = Cart.where(customer_id: params[:id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id)
            samplepd=CartItem.where(cart_id: @cartvalue.id).to_a;
            if pddetails.delete_all
---
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 5 AND `cart_items`.`item_id` IS NULL
DELETE FROM `cart_items` WHERE `cart_items`.`cart_id` = 2