app/controllers/cart_controller.rb

SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` IS NULL ORDER BY `carts`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 4
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 2
---
    def showItems
        #items = Cart.all;
        puts "in show items"
        if Cart.exists?(:customer_id => params[:customer_id])
            @cartvalue = Cart.where(customer_id: params[:customer_id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id).to_a;
            #puts pddetails[1].id
            number = pddetails.length - 1 ;
            result = Array.new;
            hash = {}
            for i in 0..number
                pid=pddetails[i].item_id;
                itemdetail=Item.find(pid);

SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT cart_items.quantity,items.id,items.sku as item_sku,items.price FROM `cart_items` INNER JOIN `carts` ON `carts`.`id` = `cart_items`.`cart_id` INNER JOIN `items` ON `items`.`id` = `cart_items`.`item_id` WHERE (carts.customer_id=1)
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 5 AND `cart_items`.`item_id` = 1
---
    def showCart
        puts "in show carts"
        if Cart.exists?(:customer_id => params[:customer_id])
            p=CartItem.joins(:cart,:item).where('carts.customer_id=1').pluck('cart_items.quantity,items.id,items.sku as item_sku,items.price');

            number = p.length-1;

SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 2 AND `cart_items`.`item_id` = 1
UPDATE `cart_items` SET `cart_items`.`quantity` = 2 WHERE `cart_items`.`cart_id` = 3 AND `cart_items`.`item_id` = 6
---
    def update
        if Cart.exists?(:customer_id => params[:id])
            @cartvalue = Cart.where(customer_id: params[:id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id])
            if pddetails.update_all(quantity: params[:quantity])

SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
INSERT INTO `carts` (`customer_id`, `created_at`, `updated_at`) VALUES (2, '2020-10-23 11:36:51.691069', '2020-10-23 11:36:51.691069')
INSERT INTO `cart_items` (`cart_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES (3, 4, 1, '2020-11-05 07:42:21.380163', '2020-11-05 07:42:21.380163')
INSERT INTO `carts` (`customer_id`, `created_at`, `updated_at`) VALUES (1, '2020-11-05 07:43:03.043378', '2020-11-05 07:43:03.043378')
INSERT INTO `cart_items` (`cart_id`, `item_id`, `quantity`, `created_at`, `updated_at`) VALUES (4, 1, 1, '2020-11-05 07:43:03.405964', '2020-11-05 07:43:03.405964')
---
    def create
        if Cart.exists?(:customer_id => params[:customer_id])
            puts "exists";
            @cartvalue = Cart.where(customer_id: params[:customer_id]).first
            puts @cartvalue.id;
            params[:cart_id] = @cartvalue.id
            cartitem = CartItem.new(cartitem_params)

            if cartitem.save
                render json: {status: 'SUCCESS', message:'Added to cartitem', data:cartitem},status: :ok
            else
                render json: {status: 'ERROR', message:'Item not saved to cartitem', data:cartitem.errors},status: :unprocessable_entity
            end
        else
            @cart = Cart.new(cart_params);
            if @cart.save
                puts "cart added";
                params[:cart_id] = @cart.id
                cartitem = CartItem.new(cartitem_params)
                if cartitem.save

SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 5
DELETE FROM `cart_items` WHERE `cart_items`.`cart_id` = 5
---
    def deleteFromCart
        if Cart.exists?(:customer_id => params[:customer_id])
            @cartvalue = Cart.where(customer_id: params[:customer_id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id])
            samplepd=CartItem.where(cart_id: @cartvalue.id,item_id: params[:item_id]).to_a;
            if pddetails.delete_all

SELECT `carts`.* FROM `carts` WHERE `carts`.`customer_id` = 1 ORDER BY `carts`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `carts` WHERE `carts`.`customer_id` = 1 LIMIT 1
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 2
SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 3
DELETE FROM `cart_items` WHERE `cart_items`.`cart_id` = 3
DELETE FROM `carts` WHERE `carts`.`customer_id` = 1
---
    def deleteallItems
        if Cart.exists?(:customer_id => params[:customer_id])
            @cartvalue = Cart.where(customer_id: params[:customer_id]).first
            puts @cartvalue.id;
            pddetails=CartItem.where(cart_id: @cartvalue.id)
            samplepd=CartItem.where(cart_id: @cartvalue.id).to_a;
            if pddetails.delete_all
                if Cart.where(customer_id: params[:customer_id]).delete_all