app/controllers/customers_controller.rb

    def index
        customers = Customer.all;
---
SELECT `customers`.* FROM `customers`

    def show
        customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 2 LIMIT 1

    def create
        customer = Customer.new(customer_params)

        if customer.save
---
INSERT INTO `customers` (`gmail`, `address`, `phone_no`, `name`, `created_at`, `updated_at`) VALUES ('selvi', 'xxx', '1234', 'ccc', '2020-10-23 09:53:44.001402', '2020-10-23 09:53:44.001402')

    def update
        customer = Customer.find(params[:id])
        if customer.update_attributes(customer_params)
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
UPDATE `customers` SET `customers`.`name` = 'selvi', `customers`.`updated_at` = '2020-10-23 09:54:18.729477' WHERE `customers`.`id` = 4

    def destroy
        customer = Customer.find(params[:id])
        customer.destroy
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
DELETE FROM `customers` WHERE `customers`.`id` = 4