app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
---
    def index
        items = Item.all;

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
    def show
        item = Item.find(params[:id])

INSERT INTO `items` (`id`, `sku`, `description`, `price`, `stock`, `created_at`, `updated_at`) VALUES (2, 'bangle_80', 'earings', 12.0, 18, '2020-10-22 13:10:32.426735', '2020-10-22 13:10:32.426735')
---
    def create
        item = Item.new(item_params)

        if item.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
UPDATE `items` SET `items`.`sku` = 'bangle_96', `items`.`updated_at` = '2020-10-22 13:15:28.359673' WHERE `items`.`id` = 2
---
    def update
        item = Item.find(params[:id])
        if item.update_attributes(item_params)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 2
---
    def destroy
        item = Item.find(params[:id])
        item.destroy