app/controllers/order_controller.rb

INSERT INTO `orders` (`customer_id`, `created_at`, `updated_at`) VALUES (1, '2020-11-06 11:08:12.052230', '2020-11-06 11:08:12.052230')
INSERT INTO `order_items` (`item_id`,`quantity`,`order_id`) VALUES (1, 2, 9), (2, 2, 9) ON DUPLICATE KEY UPDATE `item_id`=`item_id`
---
    def create
        @order = Order.new(order_params);
        if @order.save
            puts "order added";
            params[:order_id] = @order.id
            orderdetail=params[:order_data];
            number=orderdetail.length-1;
            for i in 0..number
                orderdetail[i]["order_id"]=params[:order_id]
                puts orderdetail[i];
                #orderitem = OrderItem.new(orderdetail[i])
                if OrderItem.create(orderdetail[i])