app/controllers/products_controller.rb

  def show
    puts "In show method"
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 4 LIMIT 1

  def create
    @product = Product.new(product_params)
      if @product.save
---
INSERT INTO `products` (`title`, `description`, `created_at`, `updated_at`) VALUES ('Jewellery', 'Earings', '2020-10-16 10:15:26.119746', '2020-10-16 10:15:26.119746')

  def update
    @product = Product.find(params[:id])
      if @product.update(product_params)
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 7 LIMIT 1
UPDATE `products` SET `products`.`title` = 'Jewellerys', `products`.`updated_at` = '2020-10-16 10:15:32.787172' WHERE `products`.`id` = 7